#### RuledSurface Members

---

|  |
| --- |
| RuledSurface Class   Methods   Properties   See Also |

The  RuledSurface  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create(Curve, Curve) | Creates a Surface object coincident with the ruled surface joining two bounded generating curves. |
| Public method Static member | Create(Curve, XYZ) | Creates a Surface object coincident with the ruled surface joining a bounded generating curve to a point. |
| Public method | Dispose | (Inherited from  Surface  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundingBoxUV | Gets the UV bounding box of the surface. (Inherited from  Surface  .) |
| Public method | GetFirstProfileCurve | Returns a copy of the first profile curve if it is set. |
| Public method | GetFirstProfilePoint | If a point was used to define the first profile, returns a copy of that point. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetSecondProfileCurve | Returns a copy of the second profile curve if it is set. |
| Public method | GetSecondProfilePoint | If a point was used to define the second profile, returns a copy of that point. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | HasFirstProfilePoint | Checks if a point was used to define the first profile. |
| Public method | HasSecondProfilePoint | Checks if a point was used to define the second profile. |
| Public method | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. (Inherited from  Surface  .) |
| Public method | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. (Inherited from  Surface  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Surface  .) |
| Public property | OrientationMatchesParametricOrientation | Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. (Inherited from  Surface  .) |

# See Also

RuledSurface Class

Autodesk.Revit.DB Namespace